{
  "basics": {
    "name": "Dann Stockton",
    "label": "Software Engineer",
    "picture": "https://dannstockton.com/images/logo.png",
    "email": "dannstockton@gmail.com",
    "phone": "303-304-9186",
    "website": "https://dannstockton.com",
    "summary": "Results-driven software engineer with 10 years of experience. Proven track record of designing and implementing scalable solutions in the payments space. Seeking opportunities to leverage technical expertise and leadership skills to drive innovation and deliver impactful solutions in a dynamic team environment.",
    "profiles": [
      {
        "network": "github",
        "url": "https://github.com/stringerbell",
        "username": "stringerbell"
      }
    ]
  },
  "work": [
    {
      "company": "Subsplash",
      "name": "Subsplash",
      "position": "Staff Software Engineer (Technical Lead)",
      "website": "https://subsplash.com",
      "startDate": "2019-07-22",
      "summary": "Payments team",
      "highlights": [
        "Led the payments team through explosive, COVID-fueled growth. Approximately 10x over two years. Now processing ~$2BB/year.",
        "Led the project to integrate with Stripe Treasury resulting in increased revenue.",
        "Part of an on-call rotation",
        "Served as the Technical Lead for a dedicated team of 3-6 engineers, providing strategic guidance and technical oversight to ensure project success and team cohesion.",
        "Provided mentorship and guidance to junior developers, imparting best practices and fostering skill development in writing valuable tests, simplifying logic, reducing conditionals, and addressing security vulnerabilities, thereby contributing to their professional growth and the overall success of the team.",
        "Implemented many high-impact features to help increase revenue, and maintainability, and decrease fraud.",
        "Migrated critical payment systems away from legacy PHP software to maintainable Golang microservices, with zero downtime.",
        "Used metrics to streamline the customer signup process by leveraging Step Functions/FSM, which drastically reduced complexity, increased reliability, and improved observability, ultimately elevating the overall user experience."
      ],
      "quotes": [
        "• Despite the team being understaffed, Dann has been able to maintain a consistent output and drive work to completion",
        "• Dann's efforts were monumental in shipping the new giving experience",
        "• Dann has demonstrated frequent \"big picture\" thinking and has effectively communicated strategy and details both up and out",
        "• Dann leads by example and has demonstrated extreme ownership in his efforts both across New Giving Experience",
        "• Feedback from others has been incredibly positive about you this past year."
      ]
    },
    {
      "company": "i3logix",
      "name": "i3logix",
      "position": "Sr. Software Engineer (Team/Technical Lead)",
      "website": "https://ballottrax.com",
      "startDate": "2016-01-04",
      "endDate": "2019-07-01",
      "summary": "Mail-in ballot tracking, developer workflow automation.",
      "highlights": [
        "Progressed from a Software Developer role to Software Engineer within six months, subsequently advancing to Senior Software Engineer, demonstrating consistent growth and contributions to the organization.",
        "Led a team of three engineers for the development of Ballottrax, demonstrating leadership and project management skills in delivering successful outcomes.",
        "Spearheaded the creation of a native iOS app using Swift 3 and 4, supplemented with React Native elements, showcasing versatility in mobile app development.",
        "Simplified user interface complexity by implementing a Finite State Machine (FSM), resulting in improved usability and user experience.",
        "Directed a project to automate developer workflows, streamline business processes, and integrate various services using Slack as a Command-Line Interface (CLI), akin to an internal IFTTT platform.",
        "Developed over 30 custom Slack slash commands including /auto_merge, /whynotmerge, /rebase, /mailgun, and /twilio, among others, facilitating seamless communication and task automation within the team.",
        "Engineered a rebase button workflow, streamlining version control processes and enhancing developer efficiency.",
        "Proficiently utilized a tech stack comprising Zend Framework 2-3, Apigility, Zend Expressive 1-3, PHP 7+, Postgres, React, RabbitMQ, Vagrant, Apache, and CentOS to build robust and scalable applications, showcasing expertise across various technologies and platforms."
      ]
    },
    {
      "name": "Subsplash",
      "company": "Subsplash",
      "position": "Web Developer",
      "website": "https://subsplash.com",
      "startDate": "2014-02-01",
      "endDate": "2016-01-01",
      "summary": "Turnkey apps/content management for churches & non-profits",
      "highlights": [
        "Orchestrated the migration of payment processing systems to Stripe, spearheading the implementation and automation of a comprehensive customer sign-up and account creation process utilizing webhooks. Additionally, established analytics, reporting, and data processing functionalities to streamline financial operations.",
        "Automated front-end process enhancements by developing gulp.js build scripts, incorporating features such as semantic sprites, LESS/CSS/JS minification, image optimization, and live reload, resulting in improved development efficiency and enhanced user experience.",
        "Enhanced push notification functionality by parallelizing tasks using asynchronous workers and queues, significantly improving performance and scalability of the system.",
        "Engineered a custom RSS/Atom parser for a reader project, enabling efficient parsing and organization of syndicated content for enhanced user engagement.",
        "Built an in-house image manipulation library to automate previously error-prone and manual image processing and manipulation tasks, including primary color extraction, image montage creation, and promo widget generation, streamlining content creation processes, enhancing visual appeal and reducing toil"
      ]
    },
    {
      "name": "Kicksender",
      "company": "Kicksender",
      "position": "Founder",
      "startDate": "2013-08-01",
      "endDate": "2014-08-01",
      "summary": "Digital Order Fulfillment for artists after their kickstarter project ends",
      "highlights": [
         "• Built it to offer digital fulfillment for crowd-funded projects, automating the pain of sending out lots of digital assets to lots of people reliably with a full set of features",
         "• Built in Zend Framework 1 using PHP5-FPM 5.5, MySQL, HTML5, JS, AJAX, ZMQ, Vagrant, Nginx, Ubuntu"
      ]
    },
    {
      "name": "Tifah LLC",
      "company": "Tifah LLC",
      "position": "Co-Founder",
      "startDate": "2005-03-01",
      "endDate": "2013-08-01",
      "summary": "Touring Musician",
      "highlights": [
         "• Implemented, managed, maintained Website/Marketing/Content Strategy",
         "• Helped grow our email list from 0-60,000 with various marketing strategies",
         "• Launched, built and maintained the system and server to facilitate giving away 226K albums in the span of a month (March, 2013)",
         "• Built automated incentive system for users to tweet/like/send an email in exchange for a download",
         "• Built logistical tool for tour management and ticket sales",
         "• Built complete ticketing system, and date/show manager on top of Google Calendar and Stripe",
         "• Built internal CRM tools to improve customer experience"
      ]
    }
  ],
  "skills": [
    {
      "name": "Web Development",
      "keywords": [
        "git",
        "Golang",
        "Docker",
        "Kubernetes",
        "Javascript",
        "React",
        "PHP",
        "Composer",
        "PHPUnit",
        "Behat/Gherkin",
        "Swift",
        "Redux",
        "Statecharts",
        "CSS"
      ]
    },
    {
      "name": "APIs",
      "keywords": [
        "Stripe",
        "AWS",
        "Slack",
        "Twilio",
        "Mailgun",
        "Twitter",
        "Bitbucket",
        "Jira",
        "Github",
        "ZMQ",
        "RabbitMQ",
        "Jenkins"
      ]
    }
  ],
  "publications": [
    {
      "name": "99 Bottles of OOP (PHP Version)",
      "publisher": "https://sandimetz.com/99bottles",
      "summary": "99 Bottles of OOP is a practical guide to writing cost-effective, maintainable, and pleasing object-oriented code.",
      "url": "https://sandimetz.dpdcart.com/",
      "releaseDate": "2019"
    }
  ]
}
